driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilEmpty/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://j2ee.netbeans.org/wsdl/RepeatUntilEmpty">
  <soapenv:Body>
    <rep:part1>TestEmpty</rep:part1>
    <rep:part2>3</rep:part2>
    <rep:part3>1000.00</rep:part3>
  </soapenv:Body>
</soapenv:Envelope>